app/Controllers/BidsController.php

SELECT `bid_products`.`bid_id`, `bid_products`.`unit_pack`, `bid_products`.`quantity_offered`, `bid_products`.`unit_price`, `bid_products`.`total_price`, `bid_products`.`lead_time`, `bids`.`submission_date`, `companies`.`company_name`
FROM `bid_products`
LEFT JOIN `bids` ON `bids`.`id` = `bid_products`.`bid_id`
LEFT JOIN `companies` ON `companies`.`id` = `bids`.`company_id`
WHERE `product_id` = '804e880d-5eed-4dfa-921a-58c6ab784873'
ORDER BY `bid_products`.`total_price` ASC
---
    public function financialEvaluation($tenderId = null)
    {
        if (! $tenderId) {
            return $this->failNotFound('Tender ID is required.');
        }

        $tender = $this->tenderModel->getTenderWithDetails($tenderId);

        if (! $tender) {
            return $this->failNotFound('Tender not found.');
        }

        // Fetch tender products
        $tenderProducts = $tender['products'];

        if (empty($tenderProducts)) {
            return $this->failNotFound('No products found for the specified tender.');
        }

        // Prepare response
        $evaluationData = [];

        foreach ($tenderProducts as $product) {
            // Fetch all bids for the product
            $bids = $this->bidProductModel
                ->where('product_id', $product['product_id'])
                ->join('bids', 'bids.id = bid_products.bid_id', 'INNER')
                ->join('companies', 'companies.id = bids.company_id', 'INNER')
                ->select('
                bid_products.bid_id,
                bid_products.unit_pack,
                bid_products.quantity_offered,
                bid_products.unit_price,
                bid_products.total_price,
                bid_products.lead_time,
                bids.submission_date,
                companies.company_name
            ')
                ->orderBy('bid_products.total_price', 'ASC')
                ->findAll();