app/Controllers/CategoriesController.php

    public function index()
    {
        $page = $this->request->getVar('page') ?? 1;
        $perPage = $this->request->getVar('perPage');
        if (!$perPage) {
            $perPage = null;
        }
        $title = $this->request->getVar('title');
        $description = $this->request->getVar('description');
        $where = [];
        if ($title) {
            $where['title like'] = '%' . $title . '%';
        }
        if ($description) {
            $where['description like'] = '%' . $description . '%';
        }
        $totalCategories = $this->model->selectCount('id')->where($where)->get()->getRowArray()['id'];
        $categories = $this->model->where($where)->orderBy('created_at', 'DESC')->paginate($perPage, 'categories', $page);
---
SELECT *
FROM `categories`
WHERE `categories`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `categories`
WHERE `categories`.`deleted_at` IS NULL