app/Controllers/CompaniesController.php

        ->orderBy($sortBy, $sortOrder);

    $totalCompanies = $this->model->countAllResults(false); // False to avoid resetting query
    $companies = $this->model->paginate($perPage, 'companies', $page);
---
SELECT COUNT(*) AS `numrows`
FROM `companies`


    if (!empty($companyIds)) {
        // Fetch users only if company IDs are not empty
        $users = $this->model->db->table('users')
            ->select('users.company_id, users.id as user_id, CONCAT(users.first_name, " ", users.last_name) as contact_person, users.username, users.phone_number')
            ->whereIn('users.company_id', $companyIds)
            ->get()
            ->getResultArray();
---
SELECT `users`.`company_id`, `users`.`id` as `user_id`, CONCAT(users.first_name, " ", users.last_name) as contact_person, `users`.`username`, `users`.`phone_number`
FROM `users`
WHERE `users`.`company_id` IN ('46d55608-a2e3-44ad-ad09-c63a99f90497')