app/Controllers/ProductsController.php

    public function index()
    {
        $page        = $this->request->getVar('page') ?? 1;
        $perPage     = $this->request->getVar('perPage');
        $code        = $this->request->getVar('code');
        $title       = $this->request->getVar('title');
        $description = $this->request->getVar('description');
        $category_id = $this->request->getVar('category_id');

        $where = [];

        if ($code) {
            $where['products.code like'] = '%' . $code . '%';
        }
        if ($title) {
            $where['products.title like'] = '%' . $title . '%';
        }
        if ($description) {
            $where['products.description like'] = '%' . $description . '%';
        }
        if ($category_id) {
            $where['products.category_id'] = $category_id;
        }

        // Get total products count
        $totalProducts = $this->model
            ->join('categories', 'categories.id = products.category_id', 'left')
            ->where($where)
            ->countAllResults();

        // ✅ If perPage is provided → Use pagination, otherwise → Fetch all records
        if ($perPage) {
            $products = $this->model
                ->select('products.*, categories.title as category_name')
                ->join('categories', 'categories.id = products.category_id', 'left')
                ->where($where)
                ->orderBy('products.created_at', 'DESC')
                ->paginate($perPage, 'products', $page);
        } else {
            $products = $this->model
                ->select('products.*, categories.title as category_name')
                ->join('categories', 'categories.id = products.category_id', 'left')
                ->where($where)
                ->orderBy('products.created_at', 'DESC')
                ->get()
                ->getResultArray(); // ✅ Return all without pagination
---
SELECT COUNT(`products`.`id`) AS `id`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`title` like '%Ox%'
SELECT COUNT(*) AS `numrows`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`deleted_at` IS NULL
SELECT `products`.*, `categories`.`title` as `category_name`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`deleted_at` IS NULL
ORDER BY `products`.`created_at` DESC
 LIMIT 10