app/Controllers/QuestionnairesController.php

    public function listSubmissions()
    {
        // Get pagination parameters from the query string
        $page    = $this->request->getVar('page') ?? 1;
        $perPage = $this->request->getVar('perPage');
        if (! $perPage) {
            $perPage = null; // Use default perPage if not provided
        }

        // Get filter parameters from the query string
        $companyId       = $this->request->getVar('company_id');
        $questionnaireId = $this->request->getVar('questionnaire_id');

        $searchTerm = $this->request->getVar('searchTerm');

        // Start building the query
        $query = $this->questionnaireSubmissionModel;

        $query = $query->select('questionnaire_submissions.*');
        if ($companyId) {
            $query = $query->where('company_id', $companyId);
        }

        if ($questionnaireId) {
            $query = $query->where('questionnaire_id', $questionnaireId);
        }

        $query = $query->orderBy('created_at', 'DESC');

        $totalSubmissions = $query->countAllResults(false);
        $submissions      = $query->paginate($perPage, 'questionnaire_submissions', $page);
---
SELECT COUNT(*) AS `numrows`
FROM `questionnaire_submissions`
SELECT `questionnaire_submissions`.*
FROM `questionnaire_submissions`
ORDER BY `created_at` DESC
 LIMIT 10

    public function getSubmissionById($id)
    {
        // Validate the ID
        if (! $id) {
            return $this->failNotFound('Submission ID is required.');
        }

        // Fetch the submission
        $submission = $this->questionnaireSubmissionModel->find($id);

        if (! $submission) {
            return $this->failNotFound('Submission not found.');
        }

        // Add related data to the submission
        $submission['questionnaire']  = $this->model->getQuestionnaireWithDetailsById($submission['questionnaire_id']);
        $submission['attachments']    = $this->questionnaireSubmissionAttachmentModel->getRecordsBySubmissionId($submission['id']);
        $submission['status_history'] = $this->questionnaireSubmissionStatusHistoryModel->getRecordsBySubmissionId($submission['id']);
        $submission['status']         = $this->statusModel->findById($submission['current_status_id']);
---
SELECT *
FROM `questionnaire_submissions`
WHERE `questionnaire_submissions`.`id` = 'e224634f-47f5-4dbb-a072-25ebc1389ee7'