app/Controllers/TenderProductsController.php

UPDATE `tender_products` SET `deleted_at` = '2025-03-12 17:51:59', `updated_at` = '2025-03-12 17:51:59'
WHERE `id` IN ('71454783-af56-487d-85f8-3a56854bd2f7')
AND `deleted_at` IS NULL
---
    public function delete($id = null)
    {
        // Find the tenderProduct
        $tenderProduct = $this->model->find($id);
        if (! $tenderProduct) {
            return $this->failNotFound("Tender Productnot found with ID: $id");
        }
        // Delete tenderProduct
        if ($this->model->delete($id)) {