app/Controllers/TenderStatusController.php

SELECT *
FROM `tender_status`
WHERE `tender_status`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `tender_status`
WHERE `tender_status`.`deleted_at` IS NULL
---
    public function index()
    {
        $page = $this->request->getVar('page') ?? 1;
        $perPage = $this->request->getVar('perPage');
        if (!$perPage) {
            $perPage = null;
        }
        $status = $this->request->getVar('status');
        $description = $this->request->getVar('description');
        $where = [];
        if ($status) {
            $where['status like'] = '%' . $status . '%';
        }
        if ($description) {
            $where['description like'] = '%' . $description . '%';
        }
        $totalTenderStatus = $this->model->selectCount('id')->where($where)->get()->getRowArray()['id'];
        $tenderStatuses = $this->model->where($where)->orderBy('created_at', 'DESC')->paginate($perPage, 'tender_status', $page);