app/Controllers/UsersController.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `users`.`deleted_at` IS NULL
---
        // Get total users count
        $totalUsers = $this->model->selectCount('id')->where($where)->get()->getRowArray()['id'];
        // Get users with pagination
        $users = $this->model->where($where)->paginate($perPage, 'users', $page);