app/Models/BidAttachmentModel.php

    public function getRecordsByBidId(string $bidId): array
    {
        return $this->where('bid_id', $bidId)
            ->orderBy('created_at', 'ASC') // Optional: order by creation time
            ->findAll();
---
SELECT *
FROM `bid_attachments`
WHERE `bid_id` = 'f1ac4fb1-b021-4d2b-8cd5-3fc61bac3d48'
ORDER BY `created_at` ASC