app/Models/BidProductModel.php

    public function getRecordsByBidId(string $bidId): array
    {
        return $this->select('bid_products.*, products.title as product_name, products.description as product_description')
            ->join('products', 'products.id = bid_products.product_id', 'left') // Join products table
            ->where('bid_products.bid_id', $bidId)
            ->orderBy('bid_products.created_at', 'ASC') // Optional: order by creation time
            ->findAll();
---
SELECT `bid_products`.*, `products`.`title` as `product_name`, `products`.`description` as `product_description`
FROM `bid_products`
LEFT JOIN `products` ON `products`.`id` = `bid_products`.`product_id`
WHERE `bid_products`.`bid_id` = 'f1ac4fb1-b021-4d2b-8cd5-3fc61bac3d48'
ORDER BY `bid_products`.`created_at` ASC