app/Models/BidStatusHistoryModel.php

SELECT `bid_status_history`.*, CONCAT(users.first_name, ' ', users.last_name) as changed_by_name, `status`.`title` as `status`
FROM `bid_status_history`
LEFT JOIN `users` ON `users`.`id` = `bid_status_history`.`changed_by`
LEFT JOIN `status` ON `status`.`id` = `bid_status_history`.`status_id`
WHERE `bid_status_history`.`bid_id` = 'f1ac4fb1-b021-4d2b-8cd5-3fc61bac3d48'
ORDER BY `change_date` DESC
---
    public function getRecordsByBidId(string $bidId): array
    {
        return $this->select(
            "bid_status_history.*,
                 CONCAT(users.first_name,' ',users.last_name) as changed_by_name,
                 status.title as status"
        )
            ->join('users', 'users.id = bid_status_history.changed_by', 'left')
            ->join('status', 'status.id = bid_status_history.status_id', 'left')
            ->where('bid_status_history.bid_id', $bidId)
            ->orderBy('change_date', 'DESC') // Optional: Order by change date
            ->findAll();