app/Models/CompanyModel.php

SELECT *
FROM `companies`
WHERE `id` = 'cadc7e10-f5f2-4b9b-8df1-449fe2548bae'
AND `companies`.`deleted_at` IS NULL
 LIMIT 1
---
    public function findById(string $id): ?array
    {
        // Fetch the company record by ID
        return $this->where('id', $id)->first();