app/Models/PrequalifiedCompanyModel.php

SELECT *
FROM `prequalified_companies`
JOIN `products` ON `products`.`id` = `prequalified_companies`.`product_id`
WHERE `company_id` = '46d55608-a2e3-44ad-ad09-c63a99f90497'
---
    public function getPrequalifiedProductsByCompanyId($companyId)
    {
        return $this->where('company_id', $companyId)
            ->join('products', 'products.id = prequalified_companies.product_id')
            ->findAll();