app/Models/ProductModel.php

SELECT *
FROM `products`
WHERE `id` = '33d4054c-d9b2-4b9c-bf80-50708f335471'
 LIMIT 1
---
    public function findById(?string $id = null): array
    {
        // Return an empty array if the ID is null
        if ($id === null) {
            return [];
        }

        // Fetch the product record by ID
        return $this->where('id', $id)->first() ?? [];