app/Models/QuestionnaireSubmissionProductModel.php

    public function getRecordsBySubmissionId(string $submissionId): array
    {
        return $this->select('
            questionnaire_submission_products.*,
            products.title AS product_name,
            products.description AS product_description,
            status.title AS status
        ')
            ->join('products', 'products.id = questionnaire_submission_products.product_id', 'inner')
            ->join('status', 'status.id = questionnaire_submission_products.current_status_id', 'inner')
            ->where('questionnaire_submission_products.submission_id', $submissionId)
            ->orderBy('questionnaire_submission_products.created_at', 'ASC')
            ->findAll();
---
SELECT `questionnaire_submission_products`.*, `products`.`title` AS `product_name`, `products`.`description` AS `product_description`, `status`.`title` AS `status`
FROM `questionnaire_submission_products`
INNER JOIN `products` ON `products`.`id` = `questionnaire_submission_products`.`product_id`
INNER JOIN `status` ON `status`.`id` = `questionnaire_submission_products`.`current_status_id`
WHERE `questionnaire_submission_products`.`submission_id` = '8d7a60d4-e668-4696-aec8-88a1821497ed'
ORDER BY `questionnaire_submission_products`.`created_at` ASC