app/Models/QuestionnaireSubmissionStatusHistoryModel.php

    public function getRecordsBySubmissionId(string $submissionId): array
    {
        return $this->select(
            "questionnaire_submission_status_history.*,
                 CONCAT(users.first_name,' ',users.last_name) as changed_by_name,
                 status.title as status"
        )
            ->join('users', 'users.id = questionnaire_submission_status_history.changed_by', 'left')
            ->join('status', 'status.id = questionnaire_submission_status_history.status_id', 'left')
            ->where('questionnaire_submission_status_history.submission_id', $submissionId)
            ->orderBy('change_date', 'DESC') // Optional: Order by change date
            ->findAll();
---
SELECT `questionnaire_submission_status_history`.*, CONCAT(users.first_name, ' ', users.last_name) as changed_by_name, `status`.`title` as `status`
FROM `questionnaire_submission_status_history`
LEFT JOIN `users` ON `users`.`id` = `questionnaire_submission_status_history`.`changed_by`
LEFT JOIN `status` ON `status`.`id` = `questionnaire_submission_status_history`.`status_id`
WHERE `questionnaire_submission_status_history`.`submission_id` = '64ec22ae-fcf7-452b-8f9b-3a3a996a8cbb'
ORDER BY `change_date` DESC