app/Models/QuestionnaireSubmissionAttachmentModel.php

    public function getRecordsBySubmissionId(string $submissionId): array
    {
        return $this->where('submission_id', $submissionId)
            ->orderBy('created_at', 'ASC') // Optional: order by creation time
            ->findAll();
---
SELECT *
FROM `questionnaire_submission_attachments`
WHERE `submission_id` = '64ec22ae-fcf7-452b-8f9b-3a3a996a8cbb'
ORDER BY `created_at` ASC