app/Models/QuestionnaireModel.php

SELECT *
FROM `questionnaire_documents`
WHERE `questionnaire_id` = '71016103-9c89-40d2-8544-25a861181742'
---
    private function getDocumentsByQuestionnaireId($questionnaireId)
    {
        return $this->db->table('questionnaire_documents')
            ->select('*')
            ->where('questionnaire_id', $questionnaireId)
            ->get()
            ->getResultArray();

SELECT `questionnaire_products`.*, `products`.`code` as `code`, `products`.`title` as `title`
FROM `questionnaire_products`
JOIN `products` ON `products`.`id` = `questionnaire_products`.`product_id`
WHERE `questionnaire_products`.`questionnaire_id` = '71016103-9c89-40d2-8544-25a861181742'
---
    private function getProductsByQuestionnaireId($questionnaireId)
    {
        return $this->db->table('questionnaire_products')
            ->select('questionnaire_products.*, products.code as code, products.title as title')
            ->join('products', 'products.id = questionnaire_products.product_id')
            ->where('questionnaire_products.questionnaire_id', $questionnaireId)
            ->get()
            ->getResultArray();

SELECT *
FROM `questionnaires`
WHERE `id` = '71016103-9c89-40d2-8544-25a861181742'
 LIMIT 1
---
public function getQuestionnaireWithDetailsById($id)
{
    // Fetch the questionnaire details
    $questionnaire = $this->where('id', $id)->first();