app/Models/StatusModel.php

    public function getStatusIdByTitle(string $title): ?string
    {
        $status = $this->where('title', $title)->first();
---
SELECT *
FROM `status`
WHERE `title` = 'Approved'
 LIMIT 1

    public function findById(string $id): ?array
    {
        // Fetch the status record by ID
        return $this->where('id', $id)->first();
---
SELECT *
FROM `status`
WHERE `id` = '25a2807e-e829-46f4-88a0-050542c87f71'
 LIMIT 1