app/Models/TenderProductModel.php

SELECT `tender_products`.*, `products`.`title`, `products`.`code`, `products`.`description`
FROM `tender_products`
JOIN `products` ON `products`.`id` = `tender_products`.`product_id`
WHERE `tender_products`.`tender_id` = '84d7c9eb-7e28-4222-a698-2ebde4a3f176'
---
    public function findWithDetails(string $id)
    {
        return $this
            ->select('tender_products.*, products.title, products.code, products.description') // Select columns you need
            ->join('products', 'products.id = tender_products.product_id')
            ->where('tender_products.id', $id)
            ->first();