app/Models/TenderModel.php

SELECT `tenders`.*, `tender_status`.`status` as `current_status`, CONCAT(users.first_name, " ", users.last_name) as created_by_name
FROM `tenders`
LEFT JOIN `tender_status` ON `tender_status`.`id` = `tenders`.`current_status_id`
LEFT JOIN `users` ON `users`.`id` = `tenders`.`created_by`
ORDER BY `tenders`.`created_at` DESC
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `tenders`
LEFT JOIN `tender_status` ON `tender_status`.`id` = `tenders`.`current_status_id`
LEFT JOIN `users` ON `users`.`id` = `tenders`.`created_by`
---
    public function getTendersWithDetails(array $filters, ?int $perPage, int $page)
    {
        // Building the query with filters
        $query = $this->select('tenders.*, tender_status.status as current_status, CONCAT(users.first_name," ",users.last_name) as created_by_name')
            ->join('tender_status', 'tender_status.id = tenders.current_status_id', 'left')
            ->join('users', 'users.id = tenders.created_by', 'left')
            ->orderBy('tenders.created_at', 'DESC');

        if (!empty($filters['reference_number'])) {
            $query->like('tenders.reference_number', $filters['reference_number']);
        }
        if (!empty($filters['title'])) {
            $query->like('tenders.title', $filters['title']);
        }
        if (!empty($filters['description'])) {
            $query->like('tenders.description', $filters['description']);
        }
        if (!empty($filters['opening_date'])) {
            $query->like('tenders.opening_date', $filters['opening_date']);
        }
        if (!empty($filters['closing_date'])) {
            $query->like('tenders.closing_date', $filters['closing_date']);
        }
        if (!empty($filters['current_status_id'])) {
            $query->like('tenders.current_status_id', $filters['current_status_id']);
        }

        // Fetch paginated results
        $tenders = $query->paginate($perPage, 'tenders', $page);
        $totalTenders = $query->countAllResults(false); // Count all results without resetting query

SELECT *
FROM `tender_products`
WHERE `tender_id` = 'eceb7596-b9fb-40ff-be8c-cabeb7b9358d'
SELECT *
FROM `tender_attachments`
WHERE `tender_id` = 'eceb7596-b9fb-40ff-be8c-cabeb7b9358d'
SELECT `tender_status_history`.*, `tender_status`.`status` as `status`, CONCAT(users.first_name, " ", users.last_name) as changed_by_name
FROM `tender_status_history`
LEFT JOIN `tender_status` ON `tender_status`.`id` = `tender_status_history`.`status_id`
LEFT JOIN `users` ON `users`.`id` = `tender_status_history`.`changed_by`
WHERE `tender_status_history`.`tender_id` = 'eceb7596-b9fb-40ff-be8c-cabeb7b9358d'
---

        foreach ($tenders as &$tender) {
            // Load related tender products
            $tender['products'] = $tenderProductModel->where('tender_id', $tender['id'])->findAll();

            // Load related tender attachments
            $tender['attachments'] = $tenderAttachmentModel->where('tender_id', $tender['id'])->findAll();

            // Load tender status history
            $tender['status_history'] = $tenderStatusHistoryModel
                ->select('tender_status_history.*, tender_status.status as status, CONCAT(users.first_name," ",users.last_name) as changed_by_name')
                ->join('tender_status', 'tender_status.id = tender_status_history.status_id', 'left')
                ->join('users', 'users.id = tender_status_history.changed_by', 'left')
                ->where('tender_status_history.tender_id', $tender['id'])
                ->findAll();