app/Models/TenderModel.php

    public function getTenderWithDetails($id)
    {
        // Get the main tender with its current status
        $tender = $this->select('tenders.*, tender_status.status as current_status, CONCAT(users.first_name," ",users.last_name) as created_by_name')
            ->join('tender_status', 'tender_status.id = tenders.current_status_id', 'left')
            ->join('users', 'users.id = tenders.created_by', 'left')
            ->where('tenders.id', $id)
            ->first();

        if (! $tender) {
            return null; // Return null if no tender is found
        }

        // Load related tender products
        $tenderProductModel = new \App\Models\TenderProductModel();
        $tender['products'] = $tenderProductModel->getProductsByTenderIdWithDetails($id);
        //$tenderProductModel->where('tender_id', $id)->findAll();

        // Load related tender attachments
        $tenderAttachmentModel = new \App\Models\TenderAttachmentModel();
        $tender['attachments'] = $tenderAttachmentModel->where('tender_id', $id)->findAll();

        // Load tender status history
        $tenderStatusHistoryModel = new \App\Models\TenderStatusHistoryModel();
        $tender['status_history'] = $tenderStatusHistoryModel
            ->select('tender_status_history.*, tender_status.status as status, CONCAT(users.first_name," ",users.last_name) as changed_by_name')
            ->join('tender_status', 'tender_status.id = tender_status_history.status_id', 'left')
            ->join('users', 'users.id = tender_status_history.changed_by', 'left')
            ->where('tender_status_history.tender_id', $id)
            ->findAll();
---
SELECT `tenders`.*, `tender_status`.`status` as `current_status`, CONCAT(users.first_name, " ", users.last_name) as created_by_name
FROM `tenders`
LEFT JOIN `tender_status` ON `tender_status`.`id` = `tenders`.`current_status_id`
LEFT JOIN `users` ON `users`.`id` = `tenders`.`created_by`
WHERE `tenders`.`id` = '84d7c9eb-7e28-4222-a698-2ebde4a3f176'
 LIMIT 1
SELECT *
FROM `tender_attachments`
WHERE `tender_id` = '84d7c9eb-7e28-4222-a698-2ebde4a3f176'
SELECT `tender_status_history`.*, `tender_status`.`status` as `status`, CONCAT(users.first_name, " ", users.last_name) as changed_by_name
FROM `tender_status_history`
LEFT JOIN `tender_status` ON `tender_status`.`id` = `tender_status_history`.`status_id`
LEFT JOIN `users` ON `users`.`id` = `tender_status_history`.`changed_by`
WHERE `tender_status_history`.`tender_id` = '84d7c9eb-7e28-4222-a698-2ebde4a3f176'

    public function getTendersWithDetails(array $filters, ?int $perPage, int $page)
    {
        // Building the query with filters
        $query = $this->select('tenders.*, tender_status.status as current_status, CONCAT(users.first_name," ",users.last_name) as created_by_name')
            ->join('tender_status', 'tender_status.id = tenders.current_status_id', 'left')
            ->join('users', 'users.id = tenders.created_by', 'left')
            ->orderBy('tenders.created_at', 'DESC');

        $tenderStatusModel = new \App\Models\TenderStatusModel();

        if (! empty($filters['reference_number'])) {
            $query->like('tenders.reference_number', $filters['reference_number']);
        }
        if (! empty($filters['title'])) {
            $query->like('tenders.title', $filters['title']);
        }
        if (! empty($filters['description'])) {
            $query->like('tenders.description', $filters['description']);
        }
        if (! empty($filters['floating_date'])) {
            $query->like('tenders.floating_date', $filters['floating_date']);
        }
        if (! empty($filters['closing_date'])) {
            $query->like('tenders.closing_date', $filters['closing_date']);
        }
        if (! empty($filters['current_status_id'])) {
            $query->like('tenders.current_status_id', $filters['current_status_id']);
        }
        if (! empty($filters['status'])) {
            $status = $tenderStatusModel->where('status', $filters['status'])->first();
---
SELECT `tenders`.*, `tender_status`.`status` as `current_status`, CONCAT(users.first_name, " ", users.last_name) as created_by_name
FROM `tenders`
LEFT JOIN `tender_status` ON `tender_status`.`id` = `tenders`.`current_status_id`
LEFT JOIN `users` ON `users`.`id` = `tenders`.`created_by`
WHERE `tenders`.`current_status_id` LIKE '%d67513b4-bd9b-4e77-b3af-c454da5cfb25%' ESCAPE '!'
ORDER BY `tenders`.`created_at` DESC
 LIMIT 5
SELECT *
FROM `tender_status`
WHERE `status` = 'Closed'
 LIMIT 1


        // Fetch paginated results
        $totalTenders = $query->countAllResults(false);
        $tenders      = $query->paginate($perPage, 'tenders', $page);
---
SELECT COUNT(*) AS `numrows`
FROM `tenders`

        foreach ($tenders as &$tender) {
            // Load related tender products
            // $tender['products'] = $tenderProductModel->where('tender_id', $tender['id'])->findAll();
            $tender['products'] = $tenderProductModel
                ->select('tender_products.*, products.title, products.code, products.description') // Select columns you need
                ->join('products', 'products.id = tender_products.product_id')
                ->where('tender_products.tender_id', $tender['id'])
                ->findAll();

            // Load related tender attachments
            $tender['attachments'] = $tenderAttachmentModel->where('tender_id', $tender['id'])->findAll();

            // Load tender status history
            $tender['status_history'] = $tenderStatusHistoryModel
                ->select('tender_status_history.*, tender_status.status as status, CONCAT(users.first_name," ",users.last_name) as changed_by_name')
                ->join('tender_status', 'tender_status.id = tender_status_history.status_id', 'left')
                ->join('users', 'users.id = tender_status_history.changed_by', 'left')
                ->where('tender_status_history.tender_id', $tender['id'])
                ->findAll();

            // Count the number of approved approvals
            $tender['total_approvals'] = $tenderApprovalModel->where(['approval_type' => 'approved', 'tender_id' => $tender['id']])->countAllResults();
// Count the number of rejected approvals
            $tender['total_rejections'] = $tenderApprovalModel->where(['approval_type' => 'rejected', 'tender_id' => $tender['id']])->countAllResults();
---
SELECT `tender_products`.*, `products`.`title`, `products`.`code`, `products`.`description`
FROM `tender_products`
JOIN `products` ON `products`.`id` = `tender_products`.`product_id`
WHERE `tender_products`.`tender_id` = 'fdbf21a9-eac4-4dc9-9e23-61ae6ac05e99'
AND `tender_products`.`deleted_at` IS NULL
SELECT *
FROM `tender_attachments`
WHERE `tender_id` = 'fdbf21a9-eac4-4dc9-9e23-61ae6ac05e99'
AND `tender_attachments`.`deleted_at` IS NULL
SELECT `tender_status_history`.*, `tender_status`.`status` as `status`, CONCAT(users.first_name, " ", users.last_name) as changed_by_name
FROM `tender_status_history`
LEFT JOIN `tender_status` ON `tender_status`.`id` = `tender_status_history`.`status_id`
LEFT JOIN `users` ON `users`.`id` = `tender_status_history`.`changed_by`
WHERE `tender_status_history`.`tender_id` = 'fdbf21a9-eac4-4dc9-9e23-61ae6ac05e99'
AND `tender_status_history`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `tender_approvals`
WHERE `approval_type` = 'approved'
AND `tender_id` = 'fdbf21a9-eac4-4dc9-9e23-61ae6ac05e99'
AND `tender_approvals`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `tender_approvals`
WHERE `approval_type` = 'rejected'
AND `tender_id` = 'fdbf21a9-eac4-4dc9-9e23-61ae6ac05e99'
AND `tender_approvals`.`deleted_at` IS NULL